# PANDAS

In [50]:
import pandas as pd
import numpy as np

In [2]:
record = { 
'Name': ['Ankit','Sachin','Vinay','Akshay','Arjun','Mohit'],
'Age': [21,25,28,29,31,35],
'Stream': ['Maths','Science','Economics','Commerce','Arts','Maths'],
'Percentage':[85,99,54,65,76,33]}

In [4]:
df=pd.DataFrame(record,columns=['Name','Age','Stream','Percentage'])
df

     Name  Age     Stream  Percentage
0   Ankit   21      Maths          85
1  Sachin   25    Science          99
2   Vinay   28  Economics          54
3  Akshay   29   Commerce          65
4   Arjun   31       Arts          76
5   Mohit   35      Maths          33

In [12]:
rslt_df=df[df['Percentage'] > 90]
rslt_df

     Name  Age   Stream  Percentage
1  Sachin   25  Science          99

In [13]:
rslt_df1=df.loc[df['Percentage'] > 90]
rslt_df

     Name  Age   Stream  Percentage
1  Sachin   25  Science          99

In [17]:
rslt_df2=df.loc[df['Percentage'] != 99]
rslt_df2

     Name  Age     Stream  Percentage
0   Ankit   21      Maths          85
2   Vinay   28  Economics          54
3  Akshay   29   Commerce          65
4   Arjun   31       Arts          76
5   Mohit   35      Maths          33

In [19]:
options =['Maths','Science']
rslt_df3=df[df['Stream'].isin(options)]
rslt_df3

     Name  Age   Stream  Percentage
0   Ankit   21    Maths          85
1  Sachin   25  Science          99
5   Mohit   35    Maths          33

In [21]:
options =['Maths','Science']
rslt_df4=df.loc[~df['Stream'].isin(options)]
rslt_df4

     Name  Age     Stream  Percentage
2   Vinay   28  Economics          54
3  Akshay   29   Commerce          65
4   Arjun   31       Arts          76

In [27]:
options =['Maths','Science']
rslt_df5=df[(df['Age']==25) & df['Stream'].isin(options)]
rslt_df5

     Name  Age   Stream  Percentage
1  Sachin   25  Science          99

In [30]:
df[df['Name']=='Ankit']

    Name  Age Stream  Percentage
0  Ankit   21  Maths          85

# Series And List

In [31]:
l1=['learning','Python',"is this fun",'True']
print(l1)

['learning', 'Python', 'is this fun', 'True']

In [34]:
l2= list(('learning','for','life','true'))
print(l2)

['learning', 'for', 'life', 'true']

In [38]:
l1.append(10)

In [39]:
print(l1)

['learning', 'Python', 'is this fun', 'True', 10, 10]

In [40]:
l1.remove(10)

In [41]:
print(l1)

['learning', 'Python', 'is this fun', 'True', 10]

In [42]:
print(l1+l2)

['learning', 'Python', 'is this fun', 'True', 10, 'learning', 'for', 'life', 'true']

In [47]:
print(l2)
l1.extend(l2)
print(l1)

['learning', 'for', 'life', 'true']
['learning', 'Python', 'is this fun', 'True', 10, 'learning', 'for', 'life', 'true', 'learning', 'for', 'life', 'true', 'learning', 'for', 'life', 'true', 'learning', 'for', 'life', 'true']

In [53]:
l3=[2,4,5,6,8]
np1=np.array(l3)
print(np1.mean())
print(np1.sum())
print(np1.min())
print(np1.max())

5.0
25
2
8

In [54]:
l4=l3+[1,3,5,7,7,9]
print(l3)
print(l4)
l4.count(7)

[2, 4, 5, 6, 8]
[2, 4, 5, 6, 8, 1, 3, 5, 7, 7, 9]

2

In [61]:
l4.sort(reverse=True)
print(l4)

[9, 8, 7, 7, 6, 5, 5, 4, 3, 2, 1]

In [69]:
mylist=['a','b','c','d','e']
arr=np.array(mylist)
series=pd.Series(arr)
print(series)

0    a
1    b
2    c
3    d
4    e
dtype: object

In [72]:
series1=pd.Series(arr,index=[10,20,30,40,50])
print(series1)

10    a
20    b
30    c
40    d
50    e
dtype: object

In [73]:
data={'a':0,'b':1,'c':2,'d':3}
series2=pd.Series(data,index=['a','b','c','d'])
print(series2)

a    0
b    1
c    2
d    3
dtype: int64